monthsList = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
monthsMap = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень",
             10: "Осень", 11: "Осень", 12: "Зима"}
userInput = int(input("Введите порядковый номер месяца "))

print("Использование словаря помогло определить время года месяца, как " + monthsMap.get(userInput))
print("Использование списка помогло определить время года месяца, как " + monthsList[userInput-1])